# GetEnumerator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModule..::..GetEnumerator Method
MacroModule Class See Also
---
Returns an enumerator that iterates through a collection.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator<Macro> GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator(Of Macro)
```

Visual C++
---
```text
public:
virtual IEnumerator<Macro^>^ GetEnumerator()
```

# ### Return Value
An IEnumerator object that can be used to iterate through the collection.
# ### Implements
IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()
# See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace